Revit 2024 API
Document.Close Method
Closes the document, save the changes if there are.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool Close()
Visual Basic
Public Function Close As Boolean
Visual C++
public:
bool Close()
Return Value
False if either closing procedure fails or if saving of a modified document failed. Also returns False if closing is cancelled by an external application during 'DocumentClosing' event. When function succeeds, True is returned.
Remarks
The currently active document may not be closed by this function. It can only be closed via Revit's UI.
The changes will saved automatically, the document will not be closed if failed to save changes. If the document was created in this current session and has not been saved to a file yet, it needs to call Revit::UI::UIDocument::SaveAndClose() method instead.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when attempting to close the currently active document. Thrown if there are any transactions, sub-transactions or transaction groups which were opened by the API code, and not closed. All of these items must be handled before attempting to close the document. Thrown if the PathName is not set yet. Thrown if the saving target file is read only.
Autodesk.Revit.Exceptions.InvalidOperationException | Thrown if this a linked file.
See Also
Document Class
Close Overload
Autodesk.Revit.DB Namespace